# <--------------------- REGISTRIES ---------------------->
tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "fsouza/prettierd"
tap "anomalyco/tap"
tap "goodwithtech/r"
tap "sass/sass"

# <------------------ CLI, LIBS & FONTS ------------------>
brew "act"
brew "adr-tools"
brew "aspell"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bfg"
brew "binutils"
brew "btop"
brew "ccache"
brew "chezmoi"
brew "colima", restart_service: true
brew "coreutils"
brew "curl"
brew "d2"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fastfetch"
brew "fd"
brew "flac"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gitleaks"
brew "go"
brew "gnupg"
brew "gnuplot"
brew "gnu-sed"
brew "gnutls"
brew "golangci-lint"
brew "goodwithtech/r/dockle"
brew "gradle"
brew "graphviz"
brew "grep"
brew "hadolint"
brew "helm"
brew "hostess"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "inframap"
brew "jq"
brew "k9s"
brew "kotlin"
brew "kubernetes-cli"
brew "lame"
brew "lazygit"
brew "libheif"
brew "librsvg"
brew "lima"
brew "mas"
brew "mise"
brew "mongosh"
brew "moreutils"
brew "neovim"
# <----- Neovim LSPs (also used by other editors / OpenCode) ----->
brew "bash-language-server"
brew "dockerfile-language-server"
brew "docker-language-server"
brew "gopls"
brew "jdtls"
brew "lua-language-server"
brew "marksman"
brew "pyright"
brew "terraform-ls"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
# <----- Formatters & linters used by Neovim ----->
brew "black"
brew "eslint_d"
brew "gofumpt"
brew "google-java-format"
brew "markdownlint-cli"
brew "stylua"
brew "nuclei"
brew "anomalyco/tap/opencode"
brew "p7zip"
brew "pipenv"
brew "poetry"
brew "prettierd"
brew "pstree"
brew "qemu"
brew "qt"
brew "qt@5"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "rust"
brew "sass/sass/sass"
brew "sesh"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "terraformer"
brew "tflint"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "trivy"
brew "vim"
brew "wget"
brew "xz"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# <------------------------ APPS ------------------------->
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "bambu-studio"
cask "bazecor"
cask "bbedit"
cask "bruno"
cask "chromedriver"
cask "daisydisk"
cask "discord"
cask "disk-inventory-x"
cask "displaylink"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-cousine"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-handlee"
cask "font-hasklig"
cask "font-inconsolata"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-montserrat"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-ubuntu"
cask "garmin-express"
cask "ghostty"
cask "google-chrome"
cask "gcloud-cli"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "miro"
cask "orion"
cask "raycast"
cask "shottr"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "telegram"
cask "textmate"
cask "the-unarchiver"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "webex"
cask "whatsapp"
cask "zed"

# <---------------------- APP STORE ---------------------->
# Mac App Store apps. Requires:
#   1. App Store sign-in (handled by bootstrap.sh, Phase 2).
#   2. Each app must already be "purchased" (free or paid) on this Apple ID.
#   3. An interactive terminal (sudo prompt for upgrades) — guaranteed because
#      bootstrap.sh runs interactively and chezmoi apply is invoked from within it.
mas "ColorSlurp", id: 1287239339
mas "DockLock Lite", id: 6741814079
mas "iStatistica", id: 1025822138
mas "Pastel", id: 413897608
mas "Spark Desktop", id: 6445813049
mas "Step Two", id: 1448916662
mas "Things", id: 904280696
