# <--------------------- REGISTRIES ---------------------->
tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "fsouza/prettierd"
tap "goodwithtech/r"
tap "homebrew/bundle"
tap "homebrew/services"
tap "sass/sass"

# <------------------ CLI, LIBS & FONTS ------------------>
brew "act"
brew "adr-tools"
brew "aspell"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bfg"
brew "binutils"
brew "btop"
brew "ccache"
brew "colima", restart_service: true
brew "coreutils"
brew "curl"
brew "d2"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "flac"
brew "fzf"
brew "gh"
brew "ghostty"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gitleaks"
brew "gnupg"
brew "gnuplot"
brew "gnu-sed"
brew "gnutls"
brew "golangci-lint"
brew "goodwithtech/r/dockle"
brew "gradle"
brew "graphviz"
brew "hadolint"
brew "harfbuzz"
brew "hcl2json"
brew "helm"
brew "hostess"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "imapsync"
brew "inframap"
brew "jq"
brew "k9s"
brew "kotlin"
brew "kubernetes-cli"
brew "lame"
brew "lazygit"
brew "libheif"
brew "librsvg"
brew "lima"
brew "mas"
brew "mise"
brew "mongosh"
brew "moreutils"
brew "neovim"
brew "nuclei"
brew "p7zip"
brew "pipenv"
brew "poetry"
brew "prettierd"
brew "pstree"
brew "qemu"
brew "qt"
brew "qt@5"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "rust"
brew "sass/sass/sass"
brew "sesh"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "terraformer"
brew "tflint"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "trivy"
brew "vim"
brew "wget"
brew "xz"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# <------------------------ APPS ------------------------->
cask "1password"
cask "appcleaner"
cask "bbedit"
cask "betterdisplay"
cask "bruno"
cask "daisydisk"
cask "disk-inventory-x"
cask "displaylink"
cask "elgato-camera-hub"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-cousine"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-handlee"
cask "font-hasklig"
cask "font-inconsolata"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-montserrat"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-open-sans"
cask "font-pt-mono"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-ubuntu"
cask "garmin-express"
cask "google-chrome"
cask "google-cloud-sdk"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "nordpass"
cask "nordvpn"
cask "onedrive"
cask "postman"
cask "raycast"
cask "shottr"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "telegram"
cask "textmate"
cask "the-unarchiver"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "webex"
cask "zed"

# <---------------------- APP STORE ---------------------->
mas "ColorSlurp", id: 1287239339
# Replaced by raycast
# mas "Divvy", id: 413857545
mas "iStatistica", id: 1025822138
mas "NordPass Safari Ext", id: 6443917910
mas "OneAuth", id: 1142928979
mas "Pastel", id: 413897608
mas "Step Two", id: 1448916662
mas "Things", id: 904280696

# <----------------- VSCODE EXTENSIONS ------------------->
vscode "adam-bender.commit-message-editor"
vscode "akamud.vscode-theme-onedark"
vscode "azemoh.one-monokai"
vscode "bee.git-temporal-vscode"
vscode "bereketsemagn.lunar"
vscode "chaitanyashahare.lazygit"
vscode "ciarant.vscode-structurizr"
vscode "dawhite.mustache"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.github-actions"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "inadarei.jwt"
vscode "jebbs.plantuml"
vscode "lihui.vs-color-picker"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "perkovec.emoji"
vscode "qhoekman.language-plantuml"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shyykoserhiy.git-autoconfig"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "terrastruct.d2"
vscode "timonwong.shellcheck"
vscode "voronenko.vscode-plantuml-stdlib-snippets"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "yokawasa.jwt-debugger"
