######### General #########
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'buo/cask-upgrade'

######### Casks #########
cask '1password'
cask 'appcleaner'
cask 'authy'
cask 'bbedit'
cask 'copyclip'
cask 'daisydisk'
cask 'disk-inventory-x'
cask 'displaylink'
cask 'elgato-camera-hub'
cask 'fig'
cask 'firefox'
cask 'garmin-express'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'hyper'
cask 'iterm2'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'maccy'
cask 'notion'
cask 'onyx'
cask 'postman'
cask 'remarkable'
cask 'spotify'
cask 'the-unarchiver'
cask 'slack'
cask 'sourcetree'
cask 'webex'
cask 'whatsapp'
cask 'via'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'

######### Fonts #########
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-open-sans'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-ubuntu'
cask 'font-noto-sans'
cask 'font-noto-emoji'
cask 'font-noto-color-emoji'
cask 'font-noto-serif'
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-montserrat'
cask 'font-fontawesome'
cask 'font-cousine'
cask 'font-handlee'
cask 'font-awesome-terminal-fonts'
cask 'font-hack'

######### Brews #########
brew 'adr-tools'
brew 'aspell'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'binutils'
brew 'btop'
brew 'ccache'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'dive'
brew 'docker'
brew 'docker-compose'
brew 'flac'
brew 'git'
brew 'gh'
brew 'git-extras'
brew 'gitleaks'
brew 'gnupg2'
brew 'gnuplot'
brew 'go'
brew 'graphviz'
brew 'hcl2json'
brew 'helm'
brew 'hostess'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'imapsync'
brew 'inframap'
brew 'jq'
brew 'k9s'
brew 'kubectl'
brew 'lame'
brew 'mas'
brew 'mongosh'
brew 'moreutils'
brew 'openjdk@11'
brew 'openssl'
brew 'p7zip'
brew 'pstree'
brew 'python'
brew 'rbenv'
brew 'rsync'
brew 'ruby-build'
brew 'shellcheck'
brew 'stow'
brew 'terraform'
brew 'terraformer'
brew 'tfenv'
brew 'the_silver_searcher'
brew 'tree'
brew 'trivy'
brew 'vim'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'zsh'
brew 'zsh-completion'
brew 'zsh-syntax-highlighting'
